C2CRIBuildDir/projects/C2C-RI/src/TMDDv303/src/InfoLayer/Data/TCS-88-dlDeviceInformationSubscription-EC-InValid-4.data

 
#<!--   
#       Title:  TCS-88-dlDeviceInformationSubscription-EC-InValid-4
#       Description:  This test case is used to verify the SUTs support of the dlDeviceInformationSubscription dialog as an EC using the variable values specified by the Test Plan.   This test case supports verification of requirements related to user need 2.3.5.10.3 [Need to Share Intersection Status]. This Test Case tests for an invalid response result. An error response message is expected be returned with an error-code set to 4 (message is not well formed or cannot be parsed).
#       Related Procedure:  TPS-88-dlDeviceInformationSubscription-EC
#       Version/Date: 2014/01/16 03:19:56
#-->

#ITERATION NAME = One
#GROUP NAME = General
#PARAMETER TYPE = Boolean
#EDITABLE = true
#DOCUMENTATION = This variable represents whether the Test Case is expected to pass.  Valid values are True or False.
CheckOutcomePassed = true

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable contains a set of element values that are expected in the message to be verified.
VerificationSpec = #VALUESPEC#Values#VALUESPEC#

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable identifies the Application Layer Standard that will be used for this test.  NTCIP2306v01 is the only valid value at this time.
ApplicationLayerStandard = NTCIP2306v01

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Publication Message to be sent to the SUT.  The variable value is set to a string that is not valid XML.
PublicationMessage = <soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://www.tmdd.org/303/messages"><soapenv:Header/><soapenv:Body><c2c:c2cMessagePublication xmlns:c2c="http://www.ntcip.org/c2c-message-administration"><informationalText>string</informationalText><subscriptionID>string</subscriptionID><subscriptionName>string</subscriptionName><subscriptionFrequency>7</subscriptionFrequency><subscriptionCount>7</subscriptionCount></c2c:c2cMessagePublication><mes:intersectionSignalStatusMsg><intersection-signal-status-item><device-status-header><restrictions><organization-information-forwarding-restrictions>not to public</organization-information-forwarding-restrictions></restrictions><organization-information><organization-id>agency.com</organization-id><organization-name>string</organization-name><organization-location>stringstri</organization-location><organization-function>string</organization-function><organization-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></organization-contact-details><center-contact-list><center-contact-details><center-id>agency_test</center-id><center-name>string</center-name><center-location xmlns:lrms="http://www.LRMS-Adopted-02-00-00"><latitude>33964380</latitude><longitude>-84217945</longitude><horizontalDatum>3</horizontalDatum><height><altitude><ft>3</ft></altitude><verticalDatum>1</verticalDatum></height></center-location><center-description>string</center-description><center-type>2</center-type><center-contact-details><contact-id>string</contact-id><person-name>string</person-name><person-title>string</person-title><phone-number>string</phone-number><phone-alternate>string</phone-alternate><mobile-phone-number>string</mobile-phone-number><mobile-phone-id>string</mobile-phone-id><fax-number>string</fax-number><pager-number>string</pager-number><pager-id>string</pager-id><email-address>string</email-address><radio-unit>string</radio-unit><address-line1>string</address-line1><address-line2>string</address-line2><city>string</city><state>st</state><zip-code>string</zip-code><country>string</country></center-contact-details></center-contact-details></center-contact-list><last-update-time><date>20130531</date><time>105805</time><offset>01:00</offset></last-update-time></organization-information><device-id>string</device-id><device-status>other</device-status><center-id>agency_test</center-id><device-comm-status>operational</device-comm-status><operator-id>string</operator-id><event-id>string</event-id><response-plan-id>string</response-plan-id><last-comm-time><date>stringst</date><time>string</time><offset>strin</offset></last-comm-time></device-status-header><signal-control-source>7</signal-control-source><planned-signal-timing-mode>local manual</planned-signal-timing-mode><current-signal-timing-mode>conflict-flash</current-signal-timing-mode><section-id>string</section-id><planned-signal-timing-mode-description>string</planned-signal-timing-mode-description><timing-pattern-id-current>string</timing-pattern-id-current><timing-pattern-description>string</timing-pattern-description><actuation-mode>fixed-time</actuation-mode><timing-phase-plan-mode>6</timing-phase-plan-mode><cycle-length-planned>6</cycle-length-planned><cycle-length-current>6</cycle-length-current><cycle-length-previous>6</cycle-length-previous><cycle-length-master>6</cycle-length-master><cycle-counter>5</cycle-counter><cycle-counter-master>5</cycle-counter-master><offset-reference>3</offset-reference><offset-time-planned>6</offset-time-planned><offset-time-current>6</offset-time-current><offset-time-previous>6</offset-time-previous><controller-timestamp><date>stringst</date><time>string</time><offset>strin</offset></controller-timestamp><phase-split-list><phase-split><phase-identifier>6</phase-identifier><phase-duration>7</phase-duration></phase-split></phase-split-list><ring-status-list><ring-status><ring-identifier>string</ring-identifier><ring-status>6</ring-status></ring-status></ring-status-list><phase-status><phase-status-group><phase-status-group-number>6</phase-status-group-number><phase-status-group-greens>6</phase-status-group-greens><phase-status-group-yellows>6</phase-status-group-yellows><phase-status-group-reds>6</phase-status-group-reds><phase-status-group-walks>6</phase-status-group-walks><phase-status-group-pedclears>6</phase-status-group-pedclears><phase-status-group-dontwalks>6</phase-status-group-dontwalks></phase-status-group></phase-status><overlap-status><overlap-status-group><overlap-status-group-number>6</overlap-status-group-number><overlap-status-group-greens>6</overlap-status-group-greens><overlap-status-group-yellows>6</overlap-status-group-yellows><overlap-status-group-reds>6</overlap-status-group-reds></overlap-status-group></overlap-status><active-special-functions-list><special-functions>string</special-functions></active-special-functions-list><preempt-priority-description>string</preempt-priority-description></intersection-signal-status-item><mes:intersectionSignalStatusMsg></soapenv:Body></soapenv:Envelope>

#PARAMETER TYPE = LongInteger
#EDITABLE = true
#DOCUMENTATION = This variable indicates number of publication message transmissions expected as part of this test.  Valid values are 1 to 4,294,967,295.
PublicationCount = 0

#PARAMETER TYPE = Boolean
#EDITABLE = false
#DOCUMENTATION = This variable indicates whether a Publication  error response is expected from the SUT.  Valid values are True or False.
PublicationErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable indicates the type of Publication response error that is expected from the SUT.
PublicationErrorTypeExpected = 4

#PARAMETER TYPE = Boolean
#EDITABLE = true
#DOCUMENTATION = This flag defines whether the Test Application will test for Authentication.  Valid values are True or False.
AuthenticationCheck = False

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected valid user name.
Username = defaultUser

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected valid password.
Password = defaultPassword

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the expected valid Operator Identifier.
OperatorID = defaultOperatorID

#PARAMETER TYPE = Boolean
#EDITABLE = true
#DOCUMENTATION = This variable indicates whether the SUT has the privilege to access the information requested.  Valid values are True or False.
AllowAccess = True

#PARAMETER TYPE = Boolean
#EDITABLE = false
#DOCUMENTATION = This variable indicates whether a subscription request error is expected from the SUT.  Valid values are True or False.
SubscriptionErrorResponseExpected = True

#PARAMETER TYPE = String
#EDITABLE = false
#DOCUMENTATION = This variable indicates the type of subscription request error that is expected from the SUT.
SubscriptionErrorTypeExpected = 4

#PARAMETER TYPE = String
#EDITABLE = true
#DOCUMENTATION = This variable represents the Subscription Response Message to be sent to the SUT.
SubscriptionResponseMessage = #MESSAGESPEC#SubResponseMessage#MESSAGESPEC#


#GROUP NAME = Values

